{"Database System Concepts (Int'l Ed)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "ESE 2020 Mains Examination: Electrical Engineering - Conventional Solved Papers - Paper - 2": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective Type Pharmacy": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "A Text Book of Optics": {"rating": 0, "count": 0, "pages": 832, "categories": "Unknown", "desc": ""}, "Surveying - Vol. 2": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Political Theory": {"rating": 5, "count": 1, "pages": 678, "categories": "Political science", "desc": ""}, "39 Years' Chapterwise Topicwise Solved Papers (2020-1979) IIT JEE Mathematics": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "ESE 2019 Preliminary Exam: Civil Engineering - Topicwise Objective Solved Papers - Vol. 1": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "A Textbook of Microbiology": {"rating": 0, "count": 0, "pages": 217, "categories": "Study Aids", "desc": "\"Fundamentals of Microbiology\" is an all-encompassing and approachable examination of the realm of microbes, which serves as the foundation for life on our planet. Featuring precise and lucid writing, this book is an indispensable resource for scholars, researchers, and individuals with a keen interest in elucidating the enigmas surrounding microorganisms. By deftly interlacing historical viewpoints, fundamental principles, and current scientific investigations, the text furnishes a comprehensive comprehension of microbiology. The book covers an extensive range of subjects, including the complexities of microbial structure and function as well as the profound effects that microorganisms have on human health, the environment, and industry. Obtaining an understanding of the functions that bacteria, viruses, fungi, and protozoa play in biotechnology, ecological processes, and disease, the reader will be taken on an enthralling voyage through their realm. The book effectively connects theoretical concepts with practical implementation through its abundance of captivating illustrations, insightful examples, and tangible real-world benefits. \"Fundamentals of Microbiology\" cultivates a profound understanding of the profound influence that microorganisms have on the course of our planet. Whether one is a healthcare professional, a student aspiring to enter the scientific field, or an inquisitive individual ardent to comprehend the imperceptible forces that surround us, this book serves as a valuable companion throughout the journey towards uncovering the marvels of microbiology."}, "Principles of Microeconomics( 21st Revised Edition)(By Dr.H.L.AHUJA)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "ESE 2020 Mains Examination: Electronics & Telecommunication Engineering - Conventional Solved Papers - Paper - 2": {"rating": 4, "count": 1, "pages": 232, "categories": "Antiques & Collectibles", "desc": "2020-21 IES/ESE GENERAL STUDIES & ENGINEERING APTITUDE CIVIL ENGINEERING SOLVED PAPERS"}, "ESE 2020 Mains Examination: Civil Engineering - Conventional Solved Papers - Paper - 1": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Uchchatar Aarthik Siddhanth": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Human Anatomy By B D Chaurasia's 7th Edition (Set Of 4 Books) Vol-1,2,3&4Â Â (Paperback, BD Chaurasia's)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "English Grammar for Today: A New Introduction": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Chronicle Year Book 2020 (English)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Database Systems Concepts": {"rating": 0, "count": 0, "pages": 1349, "categories": "Computers", "desc": ""}, "Public Finance": {"rating": 0, "count": 0, "pages": 660, "categories": "Finance, Public", "desc": ""}, "ESE 2019 Preliminary Exam: Civil Engineering - Topicwise Objective Solved Papers - Vol. 2": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "39 Years' Chapterwise Topicwise Solved Papers IIT JEE Mathematics, Chemistry, Physics": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "39 Years' Chapterwise Topicwise Solved Papers (2020-1979) IIT JEE Chemistry": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Ordinary and Partial Differential Equations": {"rating": 5, "count": 1, "pages": 912, "categories": "Science", "desc": "This well-acclaimed book, now in its twentieth edition, continues to offer an in-depth presentation of the fundamental concepts and their applications of ordinary and partial differential equations providing systematic solution techniques. The book provides step-by-step proofs of theorems to enhance students' problem-solving skill and includes plenty of carefully chosen solved examples to illustrate the concepts discussed."}, "COMPREHENSIVE TEXTBOOK OF MEDICAL PHYSIOLOGY (2VOLS)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "39 Years' Chapterwise Topicwise Solved Papers IIT JEE MAIN (2020-1979) Combo Pack 3 Books Sets (Mathematics Chemistry Physics)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Shigley's Mechanical Engineering Design - SIE": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Microwave Devices and Circuits, 3e": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "ESE 2018 Mains Examination: Electrical Engineering - Conventional Solved Papers - Paper - 2": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Cracking the CSAT Paper-2": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Lakshya - Rajasthan Police Sub - Inspector Exam Book Part - I": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "NEET Prep Guide 2019(With free bookletrevision points Physics,Chemistry,Biology)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective Physics for NEET - Vol. 1": {"rating": 0, "count": 0, "pages": 897, "categories": "Unknown", "desc": "1. Best-selling study guide and well-structured study resource for NEET, AIIMS, JIPMER. 2. NEET Objective Physics Vol 1. – for class 11 3. The book follows the NCERT pattern for MBBS & BDS entrance preparation along with their school studies. 4. Diagrams, tables, figures etc support theory 5. Practice exercises after every chapter 6. Coverage of last 8 Years Questions of NEET, CBSEE AIPMT and Other Medical Entrances. The “NEET Objective Physics Volume – 01” is a complete comprehensive book designed for the medical students preparing for NEET. As the title suggests the volume -1 covers the complete NEET syllabus along with NCERT Textbook of class 11th into 17 Chapters for the simultaneous preparation of both school & exam. Every chapter is well supported by theories, diagrams, tables, figures. Important points and Notes are given in the topics to enrich students. In order to help, Check Point Exercises are given in between the text of all chapters to make students linked with the topic. Solved Examples are given with the different concepts of chapters to make students learn the problem solving skills. Exercises provided in the chapters are divided into 3 parts. Part – A: Taking it Together deals with objective questions arranged according to level of difficulty for the systematic practice. Part – B: Medical Entrance Special Format Questions – covers all special types of questions, generally asked in NEET & other Medical Entrances, Part – C: Medical Entrances’ Gallery – asked questions in Last 10 years’ (2020-2011) in NEET and other medical entrances. TOC Basic Mathematics, Units, Dimensions and Error Analysis, Vectors, Motion in One Dimension, Motion in a Plane and Projectile Motion, Laws of Motion, Work, Power and Energy, Circulation Motion, Rotation, Gravitation, Simple Harmonic Motion, Elasticity, Fluid Mechanics, Thermometry, Thermal Expansion and Kinetic Theory of Gases, Laws of Thermodynamics, Calorimetry and Heat Transfer, Wave Motion."}, "Modern Operating Systems 4e": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "ESE 2018 Mains Examination: Electronics & Telecommunication Engineering - Conventional Solved Papers - Paper - 2": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "39 Years' Chapterwise Topicwise Solved Papers (2020-1979) IIT JEE Physics": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "A Glossary of Literary Terms": {"rating": 0, "count": 0, "pages": 448, "categories": "Education", "desc": "First published over fifty years ago, A GLOSSARY OF LITERARY TERMS remains an essential text for all serious students of literature. Now fully updated to reflect the latest scholarship on recent and rapidly evolving critical theories, the eleventh edition contains a complete glossary of essential literary terms presented as a series of engaging, beautifully crafted essays that explore the terms, place them in context, and suggest related entries and additional reading. This indispensable, authoritative, and highly affordable reference covers terms useful in discussing literature and literary history, theory, and criticism. Perfect as a core text for introductory literary theory or as a supplement to any literature course, this classic work is an invaluable reference that students can continue to use throughout their academic and professional careers. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version."}, "Lakshy REET Prayavaran Adhyan Ganit & Balvikas Class 1 - 5, Level - I 2018-18": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Textbook of Refrigeration and Air-conditioning (M.E.)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Digital Logic and Computer Design (Old Edition)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Guide to RRB Electrical Engg. (Senior Section Engineer) 2016": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "COMPREHENSIVE GUIDE FOR NURSING COMPETITIVE EXAM": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Fundamentals of Applied Statistics": {"rating": 0, "count": 0, "pages": 374, "categories": "Mathematics", "desc": "As the world becomes increasingly complex, that complexity tends to be reflected in statistical approaches to things that comprise our everyday experiences. Many people now find that understanding statistics is a skill they need to succeed in the many disciplines and occupations that rely on data and numerical information. While they may not need computational skills, rigorous mathematics, or the ability to actually design studies themselves, they do need some background in the concepts essential to understanding and intelligently applying common statistical procedures and ideas. Fundamentals of Applied Statistics and Surveys provides that background. Heavily focused on conceptual content, its approach is discursive rather than computational. The author emphasizes the more easily understandable, and more generally useful, techniques most frequently encountered by those in careers other than statistics. Aimed at users of statistical information, rather than producers of it, Fundamentals of Applied Statistics and Surveys provides an accessible treatment of basic concepts and methods without involving the reader in extensive mathematics or complicated computations."}, "Advanced Economic Theory": {"rating": 0, "count": 0, "pages": 1363, "categories": "Business & Economics", "desc": "This authoritative and comprehensive text is an advanced treatise on microeconomics. Featuring simplified mathematical treatment, the book covers a wide spectrum of theories and concepts aimed at effective understanding of advanced economic theory. This revised edition explores further the concept of economic efficiency and the concept of utility and its critique by Prof. Amartya Sen. It further includes an incisive analysis of Hicksian and Slutsky substitution effect. The revision also includes important distinctions and critical analysis of several functions expositing the latest developments in the field."}, "Lakshya - Rajasthan Police Sub - Inspector Exam COMBO Part 1 and Part 2 (First Edition ; 2016)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Clinical Pathology Haematology and Blood Banking (for DMLT Students)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "ESE 2020 Mains Examination: Electronics & Telecommunication Engineering - Conventional Solved Papers - Paper - 1": {"rating": 4, "count": 1, "pages": 232, "categories": "Antiques & Collectibles", "desc": "2020-21 IES/ESE GENERAL STUDIES & ENGINEERING APTITUDE CIVIL ENGINEERING SOLVED PAPERS"}, "Classical Mechanics": {"rating": 0, "count": 0, "pages": 728, "categories": "Science", "desc": "Featuring state-of-the-art computer based technology throughout, this comprehensive book on classical mechanics bridges the gap between introductory physics and quantum mechanics, statistical mechanics and optics--giving readers a strong basis for their work in applied and pure sciences.KEY TOPICS: Introduces Mathcad, using it in to do mathematical calculations, solve problems, make plots and graphs, and generally provide more in-depth coverage and a better understanding of physics. Pays special attention to such topics of modern interest as nonlinear oscillators, central force motion, collisions in CMCS, and horizontal wind circulation. MARKET: For physicists and astronomers."}, "AFCAT (Flying Technical & Ground Duty Branch) 2019": {"rating": 0, "count": 0, "pages": 265, "categories": "Unknown", "desc": "1.The current edition of “AFCAT Solved Papers and Practice Sets” is a complete prep guide. 2. 10 Solved Papers [2015-2019] are provided to the given insight into the latest pattern 3. 15 Practice Sets are given for the complete practice of the paper 4. More 1000 original questions for practice 5. More than 3500 MCQs are given for complete revision of each topic & concept 6. Every question in the book is provided with detailed answers. AFCAT is a gateway for both male and female candidates who wish to make their career with the Indian Air Force. Every year Indian Air Force conducts AFCAT common admission test for the selection of the section of officers for Flying, Ground Duty, Logistics and Education Branches. Here is the new edition of “AFCAT 15 Practice Sets and Solved Papers (2020-2015)”, prepared for the candidates to get thorough with the exam pattern of the AFCAT Online Examination. Loaded with 12 AFCAT Solved Papers and 15 Practice Sets this book provides complete assessment before exam. Along with practice questions this book is loaded with more than 1000 original questions, 3500 MCQs and Free 5 Practice Sets for the Online Practice. Every Question given in this book is well explained with detailed and authentic solutions for better understanding. The main purpose of this book is to assure success of a candidate in AFCAT Exam. TABLE OF CONTENT 12 AFCAT SOLVED PAPERS, 15 PRACTICE SETS"}, "A Textbook of Organic Chemistry for Competitions for JEE (Main & Advanced) & All Other Engineering Entrance Examinations (2nd Year Programme) (2019-2020)": {"rating": 0, "count": 0, "pages": 1197, "categories": "Chemistry, Organic", "desc": ""}, "Exploring C": {"rating": 0, "count": 0, "pages": 0, "categories": "India", "desc": "This third edition of Exploring Early India up to c. AD 1300 offers a broad overview and connected narrative of early Indian history, taking into consideration major historical developments from the earliest times to c. AD 1300. Salient features of political, socio-economic and cultural history have been discussed elaborately, and regional diversities in early Indian history have been commented upon, keeping in sight the commonalties at the subcontinental level. Rich in empirical details and containing relevant illustrations and maps, the book delves into the historiographical thrusts and shifts in the study of early India and is marked by attempts to demonstrate elements of change in early Indian history beyond dynastic shifts. It also offers critical readings of diverse primary sources from the fields of archaeology, epigraphy, numismatics and art-history, and the various congruent, and contesting, images of the past which they generate. This book also includes two new appendices respectively on the Kushana political history and the seafaring to the island of Socotra in the light of recently discovered epigraphic data."}, "ESE 2019 Prelims Exam: Civil Engineering - Topicwise Objective Solved Papers - Vol. II": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "A Textbook of Biotechnology": {"rating": 3, "count": 2, "pages": 617, "categories": "Science", "desc": "FOR UNIVERSITIY & COLLEGE STUDENTS IN INDIA & ABROAD Due to expanding horizon of biotechnology, it was difficult to accommodate the current information of biotechnology in detail. Therefore, a separate book entitled Advanced Biotechnology has been written for the Postgraduate students of Indian University and Colleges. Therefore, the present form of A Textbook of Biotechnology is totally useful for undergraduate students. A separate section of Probiotics has been added in Chapter 18. Chapter 27 on Experiments on Biotechnology has been deleted from the book because most of the experiments have been written in ';Practical Microbiology' by R.C. Dubey and D.K. Maheshwari. Bibliography has been added to help the students for further consultation of resource materials."}, "Vardhan Comprehensive Guide for NURSING Competitive Examinations (3rd Revised edition 2020)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Principles of Microeconomics": {"rating": 5, "count": 2, "pages": 532, "categories": "Business & Economics", "desc": ""}, "Quantitative Aptitude Quantum CAT Common Admission Tests for Admission into IIMs": {"rating": 0, "count": 0, "pages": 1233, "categories": "Unknown", "desc": "1. ‘Quantum Cat’- the bestselling study guide for Management entrances 2. The entire syllabus has been divided into 21 Chapters 3. Every chapter is accompanied with CAT Test for quick revision of concepts 4. More than 400 Fundamental Concepts are provided for better understanding 5. More than 1000 Examples are provided with Use-Cases, Twists, Tricks Choices and Lateral Solutions 6. More than 5000 hand crafted problem are given for the practice 7. 2000 New MCQs have been provided for thorough practice Quantitative Aptitude is a core component for getting a winning CAT Score. Out of every section, Quantitative Ability is one of the most unpredictable and time consuming section. Quantitative Aptitude stems an important part of an individuals’ analytical and logical ability for solving complex problems, making it a filtering tool for qualifying CAT and other Management Entrances. The current edition of “Quantum Cat” has been designed by keeping in mind the needs of those who wish to enhance Quantitative Aptitude for CAT and other Management Examinations. The entire syllabus of Quantitative Aptitude section is divided into 21 Chapters and every topic has 2-3 levels of questions that help students to get prepared for the most difficult problems even beyond the CAT Level. At the end of every chapter there is ‘CAT Test’ that contains problems related to the topic that helps in the quick revision of the concepts. This edition has more than 400 Fundamental Concepts to remember, more than 1000 examples are used to give the conceptual clarity with the methods and tricks are used to solve the questions. With the solution oriented approach this book provides more than 5000 hand crafted problems with their respective solution. It also includes more than 2000 MCQs for thorough practice. This book provides the alternative and smarter solutions to get correct answers in lesser time to crack CAT. This book is highly useful for not only for management entrances but for other competitive examinations. With so many features this book is a complete preparatory guide for those who have aim to score high in CAT."}, "A Textbook of Botany": {"rating": 0, "count": 0, "pages": 1006, "categories": "Science", "desc": "This textbook presents a comprehensive treatment of Angiosperms by discussing its vital components, Taxonomy, Anatomy, Embryology including Tissue Culture and Economic Botany. Written in a simple and lucid style, it has abundance of relevant illustrations with self-explanatory diagrams. Information on new angiospermic families enhances the utility of the book. It caters primarily to the requirements of undergraduate students of Botany and would also be a useful source of reference for postgraduate students & candidates appearing for several competitive examinations."}, "Strength of Materials": {"rating": 0, "count": 0, "pages": 526, "categories": "Unknown", "desc": ""}, "Vardhan Comprehensive Guide for NURSING Competitive Examinations (3rd Revised edition 2018)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Engineering Thermodynamics": {"rating": 5, "count": 2, "pages": 1025, "categories": "Science", "desc": "This leading text in the field maintains its engaging, readable style while presenting a broader range of applications that motivate engineers to learn the core thermodynamics concepts. Two new coauthors help update the material and integrate engaging, new problems. Throughout the chapters, they focus on the relevance of thermodynamics to modern engineering problems. Many relevant engineering based situations are also presented to help engineers model and solve these problems."}, "General Knowledge": {"rating": 0, "count": 0, "pages": 296, "categories": "Art", "desc": "A collection of Stephen Bayley's writings that span the design guru's entire career."}, "RRB Group D Guide Hindi 2019": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Exploring Biology for NEET - Vol. 1": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Exploring Biology for NEET - Vol. 2": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Mathematics for Joint Entrance Examination JEE (Advanced): Calculus": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "General Studies 2019 - for UPSC, SSC, Railways, PSUs & Bank PO": {"rating": 4, "count": 1, "pages": 865, "categories": "Study Aids", "desc": "1. The entire syllabus has been divided into sections 2. Questions covered in the book contains answers side by side 3. Provides Recent Years’ General Studies questions & 4. Authentic and detailed solution have been given as per latest pattern 5. Each chapter contains variety of questions designed on the line of syllabus In order to crack the hard of the competitions one is required have a vigorous preparations and practice of the subjects. Bringing you the updated edition of the “14000 objective Questions on General Studies” a compendium of objective questions which will significantly improve the knowledge of the aspiring students. This Question Bank focuses on Indian History & Culture, India & World Geography (Env. & Eco), Indian Polity, Indian Economy, General Science, Science & Technology, General Knowledge and Current Affairs , and every section is divided into sub sections. As the titles suggest it contains 14000 objective questions covering General Studies subject. With authentic and detailed answers to the questions, aspirants get an insight into the recent examination pattern and the types of questions asked therein. Also more than 500 questions based on Current Affairs have been provided in the book to give an additional advantage to the aspirants. The book is the best preparation material for general studies for UPSC (CSAT), State PCS, CDS, NDA, etc. TOC History, Geography, Indian Polity, Indian Economy, General Science, General Knowledge"}, "Indian Army ACC Entrance Exam (2018) EDITION": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Macroeconomics": {"rating": 0, "count": 0, "pages": 46, "categories": "Business & Economics", "desc": "​Principles of Macroeconomics, Ninth Canadian Edition, breaks down concepts and emphasizes important themes for students. It is the most widely used economics textbook on the market, perfectly complementing instructor lessons. Students should expect to gain a solid understanding of economic theory through real-world applications. While it prepares students for advanced economics studies, it also speaks to people in other fields. Mankiw stresses big-picture ideas, ensuring learners are grounded in essential economic concepts and principles."}, "39 Years' Chapterwise Topicwise Solved Papers (2018-1979) IIT JEE Chemistry": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Competitive Handbook of Nursing-VOL 1": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective Chemistry for NEET - Vol. II": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Fundamentals of Biochemistry": {"rating": 0, "count": 0, "pages": 1187, "categories": "Science", "desc": "Voet, Voet and Pratt's Fundamentals of Biochemistry, 5th Edition addresses the enormous advances in biochemistry, particularly in the areas of structural biology and Bioinformatics, by providing a solid biochemical foundation that is rooted in chemistry to prepare students for the scientific challenges of the future. While continuing in its tradition of presenting complete and balanced coverage that is clearly written and relevant to human health and disease, Fundamentals of Biochemistry, 5e includes new pedagogy and enhanced visuals that provide a pathway for student learning."}, "Xam Idea Physics Class 12 for 2019 Exam": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Competitive Handbook of Nursing-VOL 2 (Competitive handbook of nursing)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Advanced Problems in Organic Chemistry": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "ESE 2019 Prelims Exam: Civil Engineering - Topicwise Objective Solved Papers - Vol. I": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective Biology (Set of 2 Volumes)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "New Simplified Physics : A Reference Book for Class 12 for 2020 Examination (Set of 2 Volumes)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "39 Years' Chapterwise Topicwise Solved Papers (2018-1979) IIT JEE Mathematics": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "JP Nursing Today (A Way to Success) For AIIMS, JIPMER, DSSSB, ESIC, PGI, RPSC, RAILWAY, MNS, RUHS & All Other Staff Nurse Competitive Examinations": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Indian Army ACC Entrance Exam": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Physics for Joint Entrance Examination JEE (Advanced): Electrostatics and Current Electricity": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Xam Idea Complete Series Science Class 9 for 2019 Exam": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Engineering Mathematics for GATE & ESE (Prelims) 2019 - Theory & Previous Solved Questions": {"rating": 0, "count": 0, "pages": 428, "categories": "Mathematics", "desc": "This book is written strictly according to the syllabus of GATE and is useful for the students of all branches of engineering for whom mathematics is compulsory. It focusses on providing good theoretical background in simple manner and explain the concepts through several solved examples. Questions from previous examinations have been used extensively. At the end of each chapter, exercises for self-practice are included."}, "Ordinary & Partial Differential Equation": {"rating": 0, "count": 0, "pages": 496, "categories": "Business & Economics", "desc": "The classic history of economic thought through the ages—now fully updated and expanded Hesiod defined the basic economic problem as one of scarce resources, a view still held by economists today. Diocletian tried to save the Roman Empire with wage and price fixes—a strategy that has not gone entirely out of style. Roger Backhouse takes readers from the ancient world to the frontiers of game theory, mechanism design, and engagements with climate science, presenting an essential history of a discipline that economist Alfred Marshall called “the study of mankind in the ordinary business of life.” Backhouse introduces the many fascinating figures who have thought about money and markets down through the centuries—from philosophers and theologians to politicians and poets—and shows how today’s economic ideas have their origins in antiquity. This updated edition of The Ordinary Business of Life includes a new chapter on contemporary economics and the rest of the book has been thoroughly revised."}, "A Textbook of Thermal Engineering: Mechanical Technology": {"rating": 0, "count": 0, "pages": 920, "categories": "Mechanical engineering", "desc": ""}, "Mathematical Physics": {"rating": 4, "count": 1, "pages": 839, "categories": "Matemáticas - Libros de texto", "desc": "Now in its third edition, Mathematical Concepts in the Physical Sciences provides a comprehensive introduction to the areas of mathematical physics. It combines all the essential math concepts into one compact, clearly written reference."}, "JEE Advanced Explorer 2019": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Prep Guide to BITSAT 2019": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "38 Years' Chapterwise Topicwise Solved Papers (2016-1979) IIT JEE Chemistry": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Lakshya for Teacher 2 Grade exam preparation. (English).": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "EHV AC/DC Transmission": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Mathematics for Joint Entrance Examination JEE (Advanced): Algebra": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "R.C.C. Designs": {"rating": 0, "count": 0, "pages": 0, "categories": "Reinforced concrete construction", "desc": ""}, "Wiley's Solomons & Fryhle Organic Chemistry (New edition) for JEE (Main & Advanced)": {"rating": 0, "count": 0, "pages": 0, "categories": "Chemistry, Organic", "desc": ""}, "Xam Idea Complete Series Science Class 9 (Old Edition)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Artificial Intelligence 3e: A Modern Approach": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Lakshya Rajasthan Ki Kala, Sanskriti Va Itihas 2019 Bhag-2": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Lakshya Rajasthan Ka Bhugol 2019 Part - I": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Rajasthan DITC - Informatics Assistant": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Macro Economic Theory 13/e PB....Jhingan M L": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Modern Operating Systems II SEM": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective NCERT at Your Fingertips for NEET-JEE MADE EASY - Chemistry": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Lakshay PTET Pre B.ED": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Building Construction": {"rating": 0, "count": 0, "pages": 1673, "categories": "Technology & Engineering", "desc": "Now in its Fifth Edition, this essential textbook has been used by thousands of students annually in schools of architecture, engineering, and construction technology. The bestselling reference focuses on the basic materials and methods used in building construction, emphasizing common construction systems such as light wood frames, masonry bearing walls, steel frames, and reinforced concrete. New introductory material on the processes, organization, constraints, and choices in construction offers a better look at the management of construction. New sections covering the building envelope uncover the secrets to designing enclosures for thermal insulation, vapor retarders, air barriers, and moisture control. The Fifth Edition also features more axonometric detail drawings and revised photographs for a thoroughly illustrated approach and the latest IBC 2006, CSI MasterFormat, ASTM references, and LEED information."}, "Strength of Material": {"rating": 0, "count": 0, "pages": 526, "categories": "Unknown", "desc": ""}, "Microeconomics 8/e (PB)....Jhingan M L": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective NCERT at Your Fingertips for NEET-AIIMS - Physics": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective Physics for NEET - Vol. 2": {"rating": 0, "count": 0, "pages": 943, "categories": "Study Aids", "desc": "1. Best-selling study guide and well-structured study resource for NEET, AIIMS, JIPMER. 2. NEET Objective Physics Vol 2. – for class 12 3. The book follows the NCERT pattern for MBBS & BDS entrance preparation along with their school studies. 4. Diagrams, tables, figures etc support theory 5. Practice exercises after every chapter 6. Coverage of last 1 Years Questions of NEET, CBSEE AIPMT and Other Medical Entrances. The “NEET Objective Physics Volume – 2” is a complete comprehensive book designed for the medical students preparing for NEET. As the title suggests the volume -2 covers the complete NEET syllabus along with NCERT Textbook of class 12th into 14 Chapters for the simultaneous preparation of both school & exam. Every chapter is well supported by theories, diagrams, tables, figures. Important points and Notes are given in the topics to enrich students. In order to help, Check Point Exercises are given in between the text of all chapters to make students linked with the topic. Solved Examples are given with the different concepts of chapters to make students learn the problem-solving skills. Exercises provided in the chapters are divided into 3 parts. Part – A: Taking it Togetherdeals with objective questions arranged topically according to level of difficulty for the systematic practice. Part – B: Medical Entrance Special Format Questions – covers all special types of questions, generally asked in NEET & other Medical Entrances, Part – C: Medical Entrances’ Gallery – asked questions in Last 1 years’ (22-211) in NEET and other medical entrances. Answers to all the questions are well defined provided in different exercises. TOC Electric Charges and Fields, Electrostatic Potential and Capacitance, Current Electricity, Magnetic Effect of Current and Moving Charges, Magnetism and Matter, Electromagnetic Induction, Altering Current, Electromagnetic Waves, Ray Optics, Waves Optics, Dual Nature of Radiation and Matter, Atoms, Nuclei, Solids and Semiconductor Devices."}, "Lakshya - Rajasthan Police Sub - Inspector Exam Book Part - II": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Mathematical Physics (Old Edition)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective Biology NEET & AIIMS (Set of 2 Volumes) (2019-2020)Session by Dr. Ali": {"rating": 0, "count": 0, "pages": 637, "categories": "Unknown", "desc": "Objective NEET (National Eligibility Cum Entrance Test) is a trusted companion for all the NEET aspirants. This series includes Physics, Chemistry and Biology divided into two volumes as per NCERT curriculum of class 11th and 12th. Written in lucid language, the book aims to provide clarity on all the concepts through meticulously developed practice questions along with previous years' questions and NCERT exemplar section. Each chapter is designed in such a way that student can recapitulate the important topics and practice exercises within a given time period. A separate section on AIIMS entrance examination in all the volumes gives an extra mileage to the aspirants. It also lays emphasis on the recent trends in topical coverage and the latest question paper pattern as appeared in the NEET examination. This book would also be useful for other medical entrance examinations like AIIMS, JIPMER, etc. Features: -Structured as per class XI and XII syllabus of NCERT curriculum with updated chapter synopsis for NEET preparation -Previous years’ questions embedded in every chapter with additional practice questions -Chapter-wise solved NCERT Exemplar questions along with ample number of practice questions -Assertion and Reason questions to aid in preparing for AIIMS and other similar exams -Mock tests and sample papers for students’ self-practice Table of Contents: 1. Reproduction in Organisms 2. Sexual Reproduction in Flowering Plant 3. Human Reproduction 4. Reproductive Health 5. Principles of Inheritance and Variation 6. Molecular Basis of Inheritance 7. Evolution 8. Human Health and Disease 9. Strategies for Enhancement in Food Production 10. Microbes in Human Welfare 11. Biotechnology Principles and Processes 12. Biotechnology and Its Application 13. Organisms and Populations 14. Ecosystem 15. Biodiversity and Conservation 16. Environmental Issues"}, "Database System Concepts and relations": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "39 Years' Chapterwise Topicwise Solved Papers (2018-1979) IIT JEE Physics": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Lakshya Rajasthan 2019 paper 1st Rajasthan bhugol & arthvavstha for all competition exams": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Lakshya Rajasthan Police - Constable": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Lakshya Rajasthan Police Constable ONLINE TEST 2019": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Advanced Problems in Organic Chemistry for JEE With Solution Manual (2019-2020)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective NCERT at Your Fingertips for NEET-JEE - Physics": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Bal RamKatha - TextBook in Hindi for Class - 6  - 645": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "UNIX CONCEPTS AND APPLICATIONS": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "English Grammar for Today Indian": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Accountancy Financial Accounting Part - 1 Textbook for Class - 11- 11110": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective NCERT at Your Fingertips for NEET-JEE - Chemistry": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Indian History (bhartiya itihas) For Civil and State level Administrative Exams by Kiran Competition Times": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Vasant Bhaag - 1 Textbook in Hindi for Class - 6  - 644": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Science Textbook for Class - 6  - 652": {"rating": 0, "count": 0, "pages": 230, "categories": "Unknown", "desc": "The book has 6 distinct Units covering a total of 17 chapters. The following are the Units: 1. Chemical reactions and some important chemical compounds, 2 Energy, 3. Life Processes, 4. Natural Resources, 5. Our Environment, 6. The Universe"}, "Linear Programming": {"rating": 0, "count": 0, "pages": 764, "categories": "Linear programming", "desc": "Linear Programming and Network Flows, now in its third edition, addresses the problem of minimizing or maximizing a linear function in the presence of linear equality or inequility constraints. This book:* Provides methods for modeling complex problems via effective algorithms on modern computers.* Presents the general theory and characteristics of optimization problems, along with effective solution algorithms.* Explores linear programming (LP) and network flows, employing polynomial-time algorithms and various specializations of the simplex method."}, "Social Change and Development in India Textbook in Sociology for Class 12  - 12109": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "OPERATING SYSTEM CONCEPTS 9ED (PB 2019)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Maths 8": {"rating": 0, "count": 0, "pages": 0, "categories": "Education", "desc": "Saxon Math 8/7 is made up of five instructional components: Warm up Activities including Facts Practice, Mental Math, and Problem Solving; Daily Lesson; Lesson Practice; Cumulative Practice; and Cumulative Tests. The new edition includes: word problems, scientific notation, statistics and probability, ratios and proportions, simplifying and balancing equations, factoring algebraic expressions, slope-intercept form, graphing linear inequalities, arcs and sectors, and the Pythagorean theorem. The Homeschool Kit includes the student textbook, a tests and worksheets booklet, and a solutions manual. Grade 7."}, "Rajasthan Ka Bhugool": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Rajasthan ki arthvyavasta": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Mathematics Textbook for Class - 6  - 650": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "The Power of Positive Thinking": {"rating": 0, "count": 0, "pages": 290, "categories": "Self-Help", "desc": "'Hundreds of people wrote this book . . Since publication of The Power of Positive Thinking . . thousands of readers have communicated with me. They told how, by the application of positive thinking principles to their own life situations, they have mastered fear, healed personal relationships, found better health, overcome inner conflicts and gained strong new confidence. ' Norman Vincent Peale from A word to the reader. Does positive thinking always work? The answer, as shown in this book, is a resounding YES. Here, in greater depth than ever before Norman Vincent Peale offers detailed programmes to help you to eliminate areas of weakness, overcome insecurity and depression, and push past the first layers of fatigue to release the vast energy within you. Here too are the dramatic true stories of people who have transformed their lives through the power of positive thinking and faith to restore confidence, vitality and happiness to their lives."}, "Chemistry Part I & II Class 12 with Free Car Anti Slip Mat (2016)": {"rating": 0, "count": 0, "pages": 463, "categories": "Science", "desc": "The fourth volume of the Collected Works is devoted to Wigner's contribution to physical chemistry, statistical mechanics and solid-state physics. In his annotation to the first part, N. Balazs clearly points out Wigner's role in early quantum chemistry and applied statistical mechanics. One corner stone was his introducing of what is now called the Wigner function, and his paper on adiabatic perturbations foreshadowed later work on Berry phases. Although few in number, Wigner's articles on solid-state physics laid the ground for the modern theory of the electronic structure of metals. W. Kohn writes about this in his annotation to Part 2 of the book and he also points out Wigner's great influence in the development of solid-state theory."}, "Fundamentals of Physical Geography - Textbook for Class - 11  - 11092": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective Food Science (9th Edition,2020)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Indian Society Textbook in Sociology for Class - 12  - 12111": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Words And Expressions 1 For Class 9- 976": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "A Textbook of Fluid Mechanics": {"rating": 4.5, "count": 14, "pages": 516, "categories": "Fluid mechanics", "desc": ""}, "Chemistry Textbook Part - 2 for Class - 12 with Free Car Anti Slip Mat": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Advanced Problems in Physical Chemistry": {"rating": 5, "count": 3, "pages": 530, "categories": "Unknown", "desc": "Advanced Problems in Physical Chemistry has been conceived to meet the specific requirements of the students preparing for IIT-JEE, Olympiad and other competitive examinations. This book provides a comprehensive and systematic coverage of problems in physical chemistry and enables quick applications of concepts through numerous problems provided in each chapter. The problems are graded as per JEE Main and Advanced respectively. The best way to ensure that students understand the concepts of physical chemistry is to solve as many problems on each topic. This book is a must-have resource for candidates preparing for JEE Main and Advanced exams."}, "Science textbook for Class -7 - 2020 (NCERT)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Together with Social Science Study Material for Class 9": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Psychology For Nurses": {"rating": 0, "count": 0, "pages": 0, "categories": "Medical", "desc": ""}, "Indian Constitution At Work Textbook in Political Science for Class - 11  - 11102": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "English 9th class workbook Words & Expression Ncert": {"rating": 0, "count": 0, "pages": 259, "categories": "Study Aids", "desc": "Description of the product: • 100% Updated with Latest Syllabus & Fully Solved Board Paper • Crisp Revision with Topic wise Revision Notes, Mind Maps & Mnemonics • Extensive Practice with 2000+ Questions & 2 Practice Papers • Concept Clarity with 1000+concepts, Smart Mind Maps & Mnemonics • Final Boost with 50+ concept videos • 100% Exam Readiness with Competency Based Questions"}, "science textbook for class 8th ncert": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Let Us C": {"rating": 4.5, "count": 3, "pages": 480, "categories": "Computers", "desc": "Let Us C has been part of learning and teaching material in mostO Over three million copies sold worldwide.Authentic Guide to C Programming LanguageBasic / Intermediate/Advanced C Programming, C Under Unix and GNOME Programming Using GTK Library DESCRIPTION\"e; Simplicity\"e; -that has been the hallmark of this book in not only its previous fourteen English editions, but also in the Hindi, Gujarati, Japanese, Korean, Chinese and US editions. This book doesn't assume any programming background. It begins with the basics and steadily builds the pace so that the reader finds it easy to handle advanced topics towards the end of the book. Easter chapter contains: Lucid explanation of the conceptWell though-out, fully working programming examplesEnd-of-chapter exercises that would help you practise the skills learned in the chapterHand-crafted \"e;KanNotes\"e; that would help you remember and revise the concepts covered in each chapterEngineering and Science Institutes round the country for years now.From last year or so, I received several suggestions that its size bepruned a bit, as many learners who learn C language in their Engineeringor Science curriculum have some familiarity with it. I am happy to fulfillthis request. I hope the readers would appreciate the lean look of thecurrent edition.In one of the previous edition I had realigned the chapters in such amanner that if a C programming course is taught using Let Us C, it can befinished in 22 lectures of one hour each, with one chapter's contentsdevoted to one lecture. I am happy that many readers liked this idea andreported that this has made their learning path trouble-free. A morerational reorganization of end-of-chapter exercises in the book has alsobeen well-received. Riding on that feedback I had introduced one morefeature in the fifteenth edition-KanNotes. These are hand-craftednotes on C programming. From the reader's emails I gather that theyhave turned out to be very useful to help revise their concepts on theday before the examination, viva-voce or interview.Many readers also told me that they have immensely benefitted fromthe inclusion of the chapter on Interview FAQs. I have improved thischapter further. The rationale behind this chapter is simple-ultimatelyall the readers of Let Us C sooner or later end up in an interview roomwhere they are required to take questions on C programming. I nowhave a proof that this chapter has helped to make that journey smoothand fruitful.All the programs present in the book (and some more) are available insource code form at www.kicit.com/books/letusc/sourcecode. You arefree to download them, improve them, change them, do whatever withthem. If you wish to get solutions for the Exercises in the book they areavailable in another book titled 'Let Us C Solutions'. If you want somemore problems for practice they are available in the book titled 'Let Us CWorkbook'. As usual, new editions of these t"}, "Mathematics - Textbook for Class 7": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Mathematics Textbook for Class 8- 852": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Ruchira Bhag - 1 Sanskrit Textbook for Class - 6  - 649": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Ruchira Bhag - 2 Sanskrit Textbook for Class - 7  - 755": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Indian Society Textbook in Sociology for Class XII": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "biology textbook for class 11th ncert": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Vigyan Textbook Science for Class - 6    - 653": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Social and Political Life Part - 1 Textbook in Social Science for Class - 6  - 658": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Our Pasts Part - 2 Textbook in History for Class - 7  - 760": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Biology NCERT Class XII Book | Nitya Online Sells": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Lakshya -RRB Railway group -D": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective NCERT at your Fingertips for NEET-AIIMS - Physics,Chemistry,Biology (3 Bk)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "ESE 2019 Prelims Exam: Mechanical Engineering - Topicwise Objective Solved Papers - Vol. I": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "NCERT Class - 12 Biology Textbook": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "38 Years' Chapterwise Topicwise Solved Papers (2015-1979) IIT JEE Chemistry by Arihant with Free Car Anti Slip Mat": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "16 Years JEE Main Chapterwise Solutions - Physics, Chemistry, Maths": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "ESE 2019 Main Exam: Civil Engineering - Subjectwise Conventional Solved Questions Paper - II": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "How to Prepare for Quantitative Aptitude for CAT (Old edition)": {"rating": 0, "count": 0, "pages": 0, "categories": "Competitive exams", "desc": ""}, "Vasant Bhaag - 2 Textbook in Hindi for Class - 7  - 750": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Xam Idea Complete Course Social Science for CBSE Class 10 - 2020 Exam": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Reinforced Concrete: Limit State Design 7th Edition": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "ESE 2019 Prelims Exam: General Studies & Engineering Aptitude - Theory and Solved Papers - Vol. 1": {"rating": 4, "count": 1, "pages": 232, "categories": "Antiques & Collectibles", "desc": "2020-21 IES/ESE GENERAL STUDIES & ENGINEERING APTITUDE CIVIL ENGINEERING SOLVED PAPERS"}, "Objective Biology NEET & AIIMS (Set of 2 Volumes) (2020-2020)Session by Dr. Ali": {"rating": 0, "count": 0, "pages": 637, "categories": "Unknown", "desc": "Objective NEET (National Eligibility Cum Entrance Test) is a trusted companion for all the NEET aspirants. This series includes Physics, Chemistry and Biology divided into two volumes as per NCERT curriculum of class 11th and 12th. Written in lucid language, the book aims to provide clarity on all the concepts through meticulously developed practice questions along with previous years' questions and NCERT exemplar section. Each chapter is designed in such a way that student can recapitulate the important topics and practice exercises within a given time period. A separate section on AIIMS entrance examination in all the volumes gives an extra mileage to the aspirants. It also lays emphasis on the recent trends in topical coverage and the latest question paper pattern as appeared in the NEET examination. This book would also be useful for other medical entrance examinations like AIIMS, JIPMER, etc. Features: -Structured as per class XI and XII syllabus of NCERT curriculum with updated chapter synopsis for NEET preparation -Previous years’ questions embedded in every chapter with additional practice questions -Chapter-wise solved NCERT Exemplar questions along with ample number of practice questions -Assertion and Reason questions to aid in preparing for AIIMS and other similar exams -Mock tests and sample papers for students’ self-practice Table of Contents: 1. Reproduction in Organisms 2. Sexual Reproduction in Flowering Plant 3. Human Reproduction 4. Reproductive Health 5. Principles of Inheritance and Variation 6. Molecular Basis of Inheritance 7. Evolution 8. Human Health and Disease 9. Strategies for Enhancement in Food Production 10. Microbes in Human Welfare 11. Biotechnology Principles and Processes 12. Biotechnology and Its Application 13. Organisms and Populations 14. Ecosystem 15. Biodiversity and Conservation 16. Environmental Issues"}, "Problems in Physical Chemistry for NEET & AIIMS (2019-2020) Session": {"rating": 0, "count": 0, "pages": 697, "categories": "Unknown", "desc": ""}, "Xam Idea Complete Course English for CBSE Class 10 - 2020 Exam": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective NCERT at your Fingertips(NEET) - Phy, Chem, Bio Combo": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Rajasthan ka Itihas - Hindi": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "GATE 2019: Civil Engineering - Solved Papers (27 Years)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "science class 10 ncert text book": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Maths Practice-cum-workbook Class 5": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Mechanical Vibrations": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Mathematics - Textbook for Class 7 Education 2020": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Business Studies Textbook for Class - 11  - 11108": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Combo of three NCERT books social science class 7 CBSE- history, geography and political": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "An Introduction to the Finite Element Method": {"rating": 0, "count": 0, "pages": 248, "categories": "Finite element method", "desc": "An Introduction to the Finite Element Method is organized and written in such a way that students should not find it difficult to understand the concepts and applications discussed in the book. Rigorous mathematical treatments and derivations are kept to a minimum. A consistent approach of finite element formulation and solution is used for every domain analysis described in the book. Plenty of simple examples are given to show students how to solve related problems. The exercises at the end of some chapters are within students' capability and can be done without using a computer. Although this book is intended primarily for undergraduate students, it is also suitable for the early part of finite element courses in postgraduate programme. The basic and conceptual approaches which are used also make this book appropriate for practising engineers who want to know and learn the finite element method."}, "Collins Easy Learner's Dictionary": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "NCERT Science And Mathematics - Textbook For Class 7 Education 2020 ( Set Of 2 Books )": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Maths class 7th Ncert with solution of arihant": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Lakshay Rajasthan 2020 Bhag 2 - Rajasthan ki Kala, Sanskrati vya Itihas": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective Chemistry for NEET & All Other Medical Entrance Examination 1st Year Programme  (2019-2020): Objective Chemistry for Medical Entrance(1st Year)": {"rating": 0, "count": 0, "pages": 729, "categories": "Unknown", "desc": "Objective NEET (National Eligibility Cum Entrance Test) is a trusted companion for all the NEET aspirants. This series includes Physics, Chemistry, and Biology divided into two volumes as per NCERT curriculum of class 11th and 12th. Written in lucid language, the book aims to provide clarity on all the concepts through meticulously developed practice questions along with previous years' questions and NCERT exemplar section. Each chapter is designed in such a way that student can recapitulate the important topics and practice exercises within a given time period. A separate section on AIIMS entrance examination in all the volumes gives extra mileage to the aspirants. It also lays emphasis on the recent trends in topical coverage and the latest question paper pattern has appeared in the NEET examination. This book would also be useful for other medical entrance examinations like AIIMS, JIPMER, etc."}, "Clinical Pathology Hematology And Blood Banking (For Dmlt Students)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Social Psychology": {"rating": 0, "count": 0, "pages": 714, "categories": "Psychology", "desc": ""}, "Maths class 8th Ncert with solution of arihant": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Veterinary Medicine (Second edition 2013)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "India a Comprehensive Geography": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "NCERT Combo Pack for Science Students Class 12 (Physics Part 1&2,Chemistry Part 1&2,English-Flamingo&Vistas,Maths Part 1&2)with Free Two Car Anti Slip Mat": {"rating": 0, "count": 0, "pages": 433, "categories": "Education", "desc": "1. This book help student to understand the theories and experiments of physics 2. The book is divided into 14 chapters for class 12th 3. Easy and interactive language eases the concepts for better understanding 4. Reference book that grasps all key points and concepts into a simpler manner, clearing all concepts. 5. The latest edition has been made to attain the entire physics concept in an easy and interactive language. 6. The book is developed volume wise to cater class wise needs. Competitive exams have been the new approach to life, for all students. Every good college is attainable through a National or Regional Level exam. NCERT Textbooks have become the benchmark for syllabus and theory for these exams. Every student needs to learn these textbooks by heart. But it’s always compact and feels short. Simplified NCERT from Arihant is one of a kind reference book that helps the student to grasp all key points and concepts in a simple manner which is easy to retain yet clearing all concepts. Physics as a subject needs visualization to learn, the latest edition has been made in such a way that you can attain the entire Physics concept in an easy and interactive language. The book is developed volume-wise to cater to class-wise needs. TABLE OF CONTENT Electric Charges and Fields, Electrostatic Potential and Capacitance, Current Electricity, Moving Charges and Magnetism, Magnetism and Matter, Electromagnetic Induction, Alternating Current, Electromagnetic Waves, Ray Optics and Optical Instruments, Waves Optics, Dual Nature of Radiation and Matter, Atoms, Nuclei, Semiconductor Electronics: Materials, Devices and Simple Circuits."}, "Business Environment": {"rating": 0, "count": 0, "pages": 657, "categories": "Business & Economics", "desc": "This text challenges students to think critically about global issues that affect the business environment and provides them with a wealth of pedagogical features that help cement learning. Its coverage includes the economic, political, social, legal, cultural, technological and financial environments. The book is truly global in coverage, with case studies and examples from all over the world, including Afghanistan, China, Sweden and Thailand. It also has a strong focus on ethics, responsibilities and sustainability and what this means for business organizations. Janet Morrison's writing style makes difficult concepts easy to understand and its clarity makes it suitable for students with English as a second language. New to this edition: - The theme of uncertainty in global contexts, examining how best to assess and confront the challenges of uncertainties and risks in the differing dimensions of the business environment - A chapter on the worldwide pandemic and the global business environment - Increased coverage of FDI, industrial policy and global communication - New coverage relating to race relations and decolonising the curriculum - 10 new cases, making a total of 52 cases, with all other cases fully updated - A brand new decision-making feature linked to some of the cases studies"}, "Atlas of Human Anatomy International Edition (Netter Basic Science)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "The Host": {"rating": 4.5, "count": 18, "pages": 537, "categories": "Fiction", "desc": "Melanie Stryder refuses to fade away. The earth has been invaded by a species that takes over the minds of their human hosts while leaving their bodies intact, and most of humanity has succumbed. Wanderer, the invading 'soul' who has been given Melanie's body, knew about the challenges of living inside a human: the overwhelming emotions, the too-vivid memories. But there was one difficulty Wanderer didn't expect: the former tenant of her body refusing to relinquish possession of her mind. Melanie fills Wanderer's thoughts with visions of the man Melanie loves - Jared, a human who still lives in hiding. Unable to separate herself from her body's desires, Wanderer yearns for a man she's never met. As outside forces make Wanderer and Melanie unwilling allies, they set off to search for the man they both love."}, "T.S. Grewal's Double Entry Book Keeping  - CBSE XI (Financial Accounting): Textbook for CBSE Class XI": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "T.S. Grewal's Double Entry Book Keeping (Section A) - ISC XII: Textbook for ISC Class 12": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "10 Last Years Solved Papers Commerce Stream: CBSE Class 12 for 2020 Examination": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "T.S. Grewal's Double Entry Book Keeping (Accounting for  Companies): Textbook for CBSE Class 12 - Vol. 2": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Textbook of Physiology Vol I & II": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Micro Economic Theory": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Data Structures and Algorithms Made Easy : Second Edition: Data Structure and Algorithmic Puzzles": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "RAS MAIN EXAM SAMAJSHASTRA PRABHNDHAN LEKHANKAN": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Objective NCERT at Your Fingertips for NEET-AIIMS - Biology (Old Edition)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Textbook of Physiology - 2 Volume Set With Free QA Physiology": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "English Course Communicative: Literature Reader Interact in English - Class 9": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Kiran's SSC English Language Chapterwise Solved Papers 11300+ Objective Questions - English - 1997-April 2018  - 1920": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Numerical Methods : For Scientific And Engineering Computation (Multi Colour Edition)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Modern Microeconomics: Theory & Applications": {"rating": 0, "count": 0, "pages": 973, "categories": "Business & Economics", "desc": "The nineteenth edition of Modern Microeconomics continues to provide a detailed understanding of the foundations of microeconomics. While it provides a solid foundation for economic analysis, it also lucidly explains the mathematical derivations of various microeconomic concepts. This textbook would be extremely useful for the students of economics."}, "Macro Economic Theory": {"rating": 0, "count": 0, "pages": 597, "categories": "Economics", "desc": ""}, "NCERT Science And Mathematics Textbook for Class - 6 Edication 2020 ( Set of 2 Books )": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Mechanical Vibrations, 4e": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Civil Engineering (Objective Type)": {"rating": 0, "count": 0, "pages": 1088, "categories": "Technology & Engineering", "desc": "The book incorporates all major topics in the civil engineering discipline and is written to serve as a refresher course with each topic presented briefly followed by an exhaustive set of objective type questions with keys for important questions at the end. It serves as a quick reference designed to help BE/B Tech undergraduate students and for practising engineers. Twenty chapters in the revised version extensively explore each key idea in civil engineering. In contrast, the questions in this book have been selected from a range of strong sources to help students learn how questions are formatted and what kinds of questions they might anticipate seeing on the test. This book is designed for students preparing for competitive exams like GATE, UPSC, IAS, IES, and SSC-JE as well as university exams. Overall the whole book has been updated, specially Chapters 3, 12, 13 & 14 on the basis of feedback received from the faculty as well as students. One new chapter “Estimation in Building Works” has been added in this new edition."}, "Turbo Machines": {"rating": 0, "count": 0, "pages": 463, "categories": "Turbomachines", "desc": ""}, "Organizational Behavior": {"rating": 0, "count": 0, "pages": 711, "categories": "Business & Economics", "desc": "This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book. Robbins/Judge presents current, relevant research in a clear, reader-friendly writing style. Globally accepted and written by one of the most foremost authors in the field, this is a necessary read for all managers, human resource workers, and anyone needing to understand and improve their people skills."}, "Ncert class 8 maths textbook": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Theory Practice Animal Taxonomy Bio 8e": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "History of Medieval India": {"rating": 3, "count": 3, "pages": 628, "categories": "Unknown", "desc": ""}, "Allens' Keynotes - Rearranged and Classified with Leading Remedies of the Materia Medica and Bowel Nosodes": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Design of Steel Structures: Oxford Higher Education (Old Edition)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Mathematics Textbook for Class - 6": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Irrigation and Water Power Engineering": {"rating": 4, "count": 6, "pages": 1030, "categories": "Irrigation engineering", "desc": ""}, "ELECTRICAL POWER SYSTEMS ( 7th ED.)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "High School English Grammar And Composition": {"rating": 1, "count": 5, "pages": 0, "categories": "English", "desc": "High School English Grammar & Composition is one of the most renowned reference guides to learn English Grammar in India. This is a part of the series of books by Wren and Martin, and it provides a comprehensive study of grammar. First published in 1935, this grammar book is now being used extensively in numerous schools across Pakistan, India, and Burma. This book has been divided into two sections, containing 84 chapters in total. The first part is about Grammar and the second part is about Composition. Some chapters include Synthesis of Sentences, Conjunctions, Direct and Indirect Speech, Comparison of Adverbs, and The Noun: Kinds of Nouns. The content of this book has been greatly influenced by The Manual of English Grammar and Composition authored by J. C. Nestfield. Through the course of this book, the authors have dealt with the very basics of grammar such as forming sentences, identifying subject and predicate, verbs, using adjectives as nouns, relative pronouns, and much more. The readers are also provided with insights into writing an essay, autobiographies, letters, and stories. High School English Grammar & Composition contains numerous exercises on grammar and composition that will help the readers test themselves from every angle."}, "Contemporary India Part - 2 Textbook in Geography for Class - 10": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Kritika Bhag - 2 TextBook in Hindi for Class 10  - 1056": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "International Banking  (CAIIB 2019)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Textbook Of Rehabilitation": {"rating": 0, "count": 0, "pages": 556, "categories": "Medical", "desc": ""}, "Themes in Indian History Part - 2 for Class - 12  - 12094": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Principles of Physics for Class XI": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Automobile Engineering Vol. 2": {"rating": 0, "count": 0, "pages": 0, "categories": "Automobiles", "desc": ""}, "T.S. Grewal's Double Entry Book Keeping  - CBSE XII (Vol. 1: Accounting for Partnership Firms): Textbook for CBSE Class XII (2019-19 Session)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Indian Economy": {"rating": 0, "count": 0, "pages": 0, "categories": "Economic development", "desc": "Written in a clear and objective manner, this revised edition provides comprehensive coverage of the Indian economy. With extensive references to original works, this account examines updated data and answers important financial questions on topics that include economic reform, foreign trade, and agricultural and industrial growth. Especially designed for less-advanced students, this resource is an ideal introduction to the Indian economy."}, "International Economics: Trade and Finance, 11ed, ISV (WSE)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "APC Mentor in English Core": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "A Text Book of Botany : Angiosperms": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Psychology Textbook for Class - 12  - 12123": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Therapeutic Exercise Foundations And Techniques": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Textbook of Business Studies for Class XI (2019-19)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Problems in Inorganic Chemistry for NEET/AIIMS (2019-2020) Session": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "NCERT Science And Mathematics Textbook For Class - 10 ( Set Of 2 Books )": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "BD CHAURASIAS HUMAN ANATOMY 7ED VOL 2 REGIONAL AND APPLIED DISSECTION AND CLINICAL LOWER LIMB ABDOMEN AND PELVIS  (PB 2018)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Trueman's Elementary Biology for class 11 and NEET - Vol. I (2020 Edition)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "English Course Communicative: Main Course Book Interact in English - Class 9": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Informatics Practices: ATextbook for Class XII": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Civil Engineering (O.T.) (Objective Type)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Diversity of Angiosperms (Systematics, Development and Reproduction)": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Pharmaceutical Analysis-I (Bpharm) on PCI Syllabus": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}, "Classical Electrodynamics, 3ed": {"rating": 0, "count": 0, "pages": 0, "categories": "Unknown", "desc": ""}}